#+title: Emacs Desktop Environment
#+PROPERTY: header-args:emacs-lisp :tangle ./desktop.el

** EXWM config (new)

#+begin_src emacs-lisp
(require 'exwm-randr)
(setq exwm-randr-workspace-output-plist '(0 "eDP1"))
(add-hook 'exwm-randr-screen-change-hook
      (lambda ()
        (start-process-shell-command
         "xrandr" nil "xrandr --output eDP1 --right-of HDMI-1-0 --auto")))
(start-process-shell-command "xrandr" nil "xrandr --output eDP-1 --primary --mode 1920x1080 --pos 0x0 --rotate normal --output DP-1 --off --output DP-2 --off --output HDMI-1 --mode 2560x1080 --pos 1920x0 --rotate normal")
(setq exwm-randr-workspace-monitor-plist '(2 "eDP-1" 3 "HDMI-1"))
(exwm-randr-enable)
#+end_src

#+RESULTS:
| exwm-systemtray--exit | exwm-randr--exit |

#+begin_src emacs-lisp
  (defun efs/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

  (use-package! exwm
    :config
    ;; Call layout function
    (efs/screen-layout)

    ;; Set the default number of workspaces
    (setq exwm-workspace-number 5)

    ;; When window "class" updates, use it to set the buffer name
    (add-hook 'exwm-update-class-hook #'efs/exwm-update-class)

    ;; Rebind CapsLock to Ctrl
    (start-process-shell-command "xmodmap" nil "xmodmap ~/.emacs.d/exwm/Xmodmap")

    ;; Set the screen resolution (update this to be the correct resolution for your screen!)
    (require 'exwm-randr)
    (exwm-randr-enable)
    ;; (start-process-shell-command "xrandr" nil "xrandr --output Virtual-1 --primary --mode 2048x1152 --pos 0x0 --rotate normal")

    ;; Load the system tray before exwm-init
    (require 'exwm-systemtray)
    (exwm-systemtray-enable)

    ;; These keys should always pass through to Emacs
    (setq exwm-input-prefix-keys
          '(?\C-x
            ?\C-u
            ?\C-
            ?\M-x
            ?\M-`
            ?\M-&
            ?\M-:
            ?\C-\M-j  ;; Buffer list
            ?\C-\ ))  ;; Ctrl+Space

    ;; Ctrl+Q will enable the next key to be sent directly
    (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

    ;; Set up global key bindings.  These always work, no matter the input state!
    ;; Keep in mind that changing this list after EXWM initializes has no effect.
    (setq exwm-input-global-keys
          `(
            ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
            ([?\s-r] . exwm-reset)

            ;; Move between windows
            ([s-left] . windmove-left)
            ([s-right] . windmove-right)
            ([s-up] . windmove-up)
            ([s-down] . windmove-down)

            ;; Launch applications via shell command
            ([?\s-&] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))

            ;; Switch workspace
            ([?\s-w] . exwm-workspace-switch)
            ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))

            ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9)))))
#+end_src

#+RESULTS:
: t

** Panel with Polybar

Polybar provides a great, minimalistic panel for your EXWM desktop configuration.  The following config integrates =emacsclient= and Polybar with =polybar-msg= to enable you to gather *any* information from Emacs and display it in the panel!

Check out the Polybar wiki for more details on how to configure it: https://github.com/polybar/polybar/wiki

#+begin_src emacs-lisp
  ;; Make sure the server is started (better to do this in your main Emacs config!)
  (server-start)

  (defvar efs/polybar-process nil
    "Holds the process of the running Polybar instance, if any")

  (defun efs/kill-panel ()
    (interactive)
    (when efs/polybar-process
      (ignore-errors
        (kill-process efs/polybar-process)))
    (setq efs/polybar-process nil))

  (defun efs/start-panel ()
    (interactive)
    (efs/kill-panel)
    (setq efs/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))

  (defun efs/send-polybar-hook (module-name hook-index)
    (start-process-shell-command "polybar-msg" nil (format "polybar-msg hook %s %s" module-name hook-index)))

  (defun efs/send-polybar-exwm-workspace ()
    (efs/send-polybar-hook "exwm-workspace" 1))

  ;; Update panel indicator when workspace changes
  (add-hook 'exwm-workspace-switch-hook #'efs/send-polybar-exwm-workspace)
#+end_src

#+RESULTS:
| efs/send-polybar-exwm-workspace | exwm-systemtray--on-workspace-switch |

The configuration for our ingeniously named panel, "panel".  Invoke it with =polybar panel= on the command line!

** .profile
#+begin_src shell :tangle ~/.profile :tangle no
  #!/bin/zsh

  # profile file. Runs on login. Environmental variables are set here.

  # If you don't plan on reverting to bash, you can remove the link in ~/.profile
  # to clean up.

  # Adds `~/.local/bin` to $PATH
  export PATH="$PATH:${$(find ~/.local/bin -type d -printf %p:)%%:}"

  unsetopt PROMPT_SP

  #Default programs:
  export EDITOR="emacs"
  export TERMINAL="st"
  export BROWSER="brave"

  # ~/ Clean-up:
  export XDG_CONFIG_HOME="$HOME/.config"
  export XDG_DATA_HOME="$HOME/.local/share"
  export XDG_CACHE_HOME="$HOME/.cache"
  export XINITRC="${XDG_CONFIG_HOME:-$HOME/.config}/x11/xinitrc"
  export XAUTHORITY="$XDG_RUNTIME_DIR/Xauthority" # This line will break some DMs.
  export NOTMUCH_CONFIG="${XDG_CONFIG_HOME:-$HOME/.config}/notmuch-config"
  export GTK2_RC_FILES="${XDG_CONFIG_HOME:-$HOME/.config}/gtk-2.0/gtkrc-2.0"
  export LESSHISTFILE="-"
  export WGETRC="${XDG_CONFIG_HOME:-$HOME/.config}/wget/wgetrc"
  export INPUTRC="${XDG_CONFIG_HOME:-$HOME/.config}/shell/inputrc"
  export ZDOTDIR="${XDG_CONFIG_HOME:-$HOME/.config}/zsh"
  #export ALSA_CONFIG_PATH="$XDG_CONFIG_HOME/alsa/asoundrc"
  #export GNUPGHOME="${XDG_DATA_HOME:-$HOME/.local/share}/gnupg"
  export WINEPREFIX="${XDG_DATA_HOME:-$HOME/.local/share}/wineprefixes/default"
  export KODI_DATA="${XDG_DATA_HOME:-$HOME/.local/share}/kodi"
  export PASSWORD_STORE_DIR="${XDG_DATA_HOME:-$HOME/.local/share}/password-store"
  export TMUX_TMPDIR="$XDG_RUNTIME_DIR"
  export ANDROID_SDK_HOME="${XDG_CONFIG_HOME:-$HOME/.config}/android"
  export CARGO_HOME="${XDG_DATA_HOME:-$HOME/.local/share}/cargo"
  export GOPATH="${XDG_DATA_HOME:-$HOME/.local/share}/go"
  export ANSIBLE_CONFIG="${XDG_CONFIG_HOME:-$HOME/.config}/ansible/ansible.cfg"
  export UNISON="${XDG_DATA_HOME:-$HOME/.local/share}/unison"
  export HISTFILE="${XDG_DATA_HOME:-$HOME/.local/share}/history"
  export WEECHAT_HOME="${XDG_CONFIG_HOME:-$HOME/.config}/weechat"

  # Other program settings:
  export DICS="/usr/share/stardict/dic/"
  export SUDO_ASKPASS="$HOME/.local/bin/dmenupass"
  export FZF_DEFAULT_OPTS="--layout=reverse --height 40%"
  export LESS=-R
  export LESS_TERMCAP_mb="$(printf '%b' '[1;31m')"
  export LESS_TERMCAP_md="$(printf '%b' '[1;36m')"
  export LESS_TERMCAP_me="$(printf '%b' '[0m')"
  export LESS_TERMCAP_so="$(printf '%b' '[01;44;33m')"
  export LESS_TERMCAP_se="$(printf '%b' '[0m')"
  export LESS_TERMCAP_us="$(printf '%b' '[1;32m')"
  export LESS_TERMCAP_ue="$(printf '%b' '[0m')"
  export LESSOPEN="| /usr/bin/highlight -O ansi %s 2>/dev/null"
  export QT_QPA_PLATFORMTHEME="gtk2"	# Have QT use gtk2 theme.
  export MOZ_USE_XINPUT2="1"		# Mozilla smooth scrolling/touchpads.
  export AWT_TOOLKIT="MToolkit wmname LG3D"	#May have to install wmname
  export _JAVA_AWT_WM_NONREPARENTING=1	# Fix for Java applications in dwm

  # This is the list for lf icons:
  export LF_ICONS="di=📁:\
  fi=📃:\
  tw=🤝:\
  ow=📂:\
  ln=⛓:\
  or=❌:\
  ex=🎯:\
  ,*.txt=✍:\
  ,*.mom=✍:\
  ,*.me=✍:\
  ,*.ms=✍:\
  ,*.png=🖼:\
  ,*.webp=🖼:\
  ,*.ico=🖼:\
  ,*.jpg=📸:\
  ,*.jpe=📸:\
  ,*.jpeg=📸:\
  ,*.gif=🖼:\
  ,*.svg=🗺:\
  ,*.tif=🖼:\
  ,*.tiff=🖼:\
  ,*.xcf=🖌:\
  ,*.html=🌎:\
  ,*.xml=📰:\
  ,*.gpg=🔒:\
  ,*.css=🎨:\
  ,*.pdf=📚:\
  ,*.djvu=📚:\
  ,*.epub=📚:\
  ,*.csv=📓:\
  ,*.xlsx=📓:\
  ,*.tex=📜:\
  ,*.md=📘:\
  ,*.r=📊:\
  ,*.R=📊:\
  ,*.rmd=📊:\
  ,*.Rmd=📊:\
  ,*.m=📊:\
  ,*.mp3=🎵:\
  ,*.opus=🎵:\
  ,*.ogg=🎵:\
  ,*.m4a=🎵:\
  ,*.flac=🎼:\
  ,*.wav=🎼:\
  ,*.mkv=🎥:\
  ,*.mp4=🎥:\
  ,*.webm=🎥:\
  ,*.mpeg=🎥:\
  ,*.avi=🎥:\
  ,*.mov=🎥:\
  ,*.mpg=🎥:\
  ,*.wmv=🎥:\
  ,*.m4b=🎥:\
  ,*.flv=🎥:\
  ,*.zip=📦:\
  ,*.rar=📦:\
  ,*.7z=📦:\
  ,*.tar.gz=📦:\
  ,*.z64=🎮:\
  ,*.v64=🎮:\
  ,*.n64=🎮:\
  ,*.gba=🎮:\
  ,*.nes=🎮:\
  ,*.gdi=🎮:\
  ,*.1=ℹ:\
  ,*.nfo=ℹ:\
  ,*.info=ℹ:\
  ,*.log=📙:\
  ,*.iso=📀:\
  ,*.img=📀:\
  ,*.bib=🎓:\
  ,*.ged=👪:\
  ,*.part=💔:\
  ,*.torrent=🔽:\
  ,*.jar=♨:\
  ,*.java=♨:\
  "
  # <<<<<<<
  [ ! -f ${XDG_CONFIG_HOME:-$HOME/.config}/shell/shortcutrc ] && shortcuts >/dev/null 2>&1 &

  if pacman -Qs libxft-bgra >/dev/null 2>&1; then
      # Start graphical server on user's current tty if not already running.
      [ "$(tty)" = "/dev/tty1" ] && ! pidof -s Xorg >/dev/null 2>&1 && exec startx
  else
      echo "\033[31mIMPORTANT\033[0m: Note that \033[32m\`libxft-bgra\`\033[0m must be installed for this build of dwm.
  Please run:
          \033[32myay -S libxft-bgra-git\033[0m
  and replace \`libxft\`. Afterwards, you may start the graphical server by running \`startx\`."
  fi

  # Switch escape and caps if tty and no passwd required:
  sudo -n loadkeys ${XDG_DATA_HOME:-$HOME/.local/share}/larbs/ttymaps.kmap 2>/dev/null

#+end_src

#+begin_src emacs-lisp
  (use-package! evil-multiedit
    :hook (web-mode . evil-multiedit-mode))
#+end_src

#+RESULTS:
| evil-multiedit-mode | (lambda nil (when (string-equal tsx (file-name-extension buffer-file-name)) (setup-tide-mode))) |

# evil multiedit
# multiple-cursors
* Celestial-mode-line
#+begin_src emacs-lisp
  (use-package! celestial-mode-line
    :config
    ;; -22°49'23.99" S -47°04'28.20" W
    (setq calendar-longitude "-22.49S") ;; 20.54S -> Franca
    (setq calendar-latitude "-47.04W")  ;; 47.40W -> Franca
    (setq calendar-location-name "Campinas, SP")
    (setq global-mode-string '("" celestial-mode-line-string display-time-string))
    (defvar celestial-mode-line-phase-representation-alist '((0 . "○") (1 . "☽") (2 . "●") (3 . "☾")))
    (defvar celestial-mode-line-sunrise-sunset-alist '((sunrise . "☀↑ ") (sunset . "☀↓ ")))
    (defvar celestial-mode-line-phase-representation-alist '((0 . "( )") (1 . "|)") (2 . "(o)") (3 . "|)")))
    (defvar celestial-mode-line-sunrise-sunset-alist '((sunrise . "*^") (sunset . "*v")))
    (celestial-mode-line-start-timer))
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp :tangle no
(eval '(solar-sunrise-sunset-string (calendar-current-date)))
#+end_src

#+RESULTS:
: Sunrise 7:39am (-03), sunset 4:24pm (-03) at Campinas, SP (8:44 hrs daylight)

